* Baseboard

** Dining room

|     raw | buffered | group | x |
|---------+----------+-------+---|
|     3.5 |        5 | g     | x |
|      49 |       50 | h     | x |
|     9.5 |       10 | b     | x |
|      64 |       65 | g     | x |
|     9.5 |       10 | b     | x |
|     9.5 |       12 | a     | x |
|      71 |       72 | a     | x |
|      79 |       90 | b     | x |
|      46 |       50 | e     | x |
|      31 |       36 | a     | x |
|---------+----------+-------+---|
| *total* |      401 |       |   |
   #+TBLFM: $1=34-3.5::$2=vsum(@2..@-1)

** Living room

|     raw | buffered | group | X |
|---------+----------+-------+---|
|      29 |       36 | h     | x |
|      13 |       14 | g     | x |
|     8.5 |       10 | c     | x |
|       9 |        8 | f     | x |
|      19 |     22.5 | d     | x |
|    61.5 |     61.5 | d     | x |
|    42.5 |       45 | f     | x |
|      31 |       31 | f     | x |
|      31 |       33 | h     | x |
|      33 |       34 | e     | x |
|     110 |      110 | c     | x |
|---------+----------+-------+---|
| *total* |      411 |       |   |
   #+TBLFM: $1=32-3.5::$2=vsum(@2..@-1)

** Groups

- a :: 71 + 31 + 9.5 = 120
- b :: 79 + 9.5 + 9.5 = 120
- c :: 110 + 8.5 = 120
- d :: 61.5 + 19 = 84
- e :: 46 + 33 = 84
- f :: 42.5 + 31 + 9 = 84
- g :: 64 + 13 + 3.5 = 84
- h :: 49 + 29 + 31 = 119 = 120
- total :: 4 x 10' ; 4 x 7' = 68'

Hallway:
- i :: 64 + 23 = 87 = 96
- j :: 52 + 17 + 14 = 83 = 96

* Trim
** Windows and doors (3.5")
|            | l    |  raw | buffered | group     |       |
|------------+------+------+----------+-----------+-------|
| front d    | df-l | 80.5 |       84 | m         | a     |
| front d    | df-r | 80.5 |       84 | n         | b     |
| front d    | df-t |   36 |       44 | s-new     | g     |
| closet     | dc-l |   80 |       84 | o         | c     |
| closet     | dc-r |   80 |       84 | p         | d     |
| closet     | dc-t |   49 |       57 | e         |       |
| office     |      |   82 |       86 | 96        | x     |
| office     |      |   82 |       86 | 96        | x     |
| office     |      |   32 |       40 | 96        | x     |
| kitchen    |      |   83 |       88 | 96        | x     |
| kitchen    |      |   83 |       88 | 96        | x     |
| kitchen    |      | 32.5 |       41 | s-new (?) | x     |
|------------+------+------+----------+-----------+-------|
| connie     | wc-b | 32.5 |       40 | q-new     | h     |
| connie     | wc-t | 32.5 |       40 | r-new     | i     |
| connie     | wc-l | 53.5 |       62 | e         | h     |
| connie     | wc-r | 53.5 |       62 | 96        | i     |
| front lawn | wf-b | 45.5 |       54 | q-new     | g     |
| front lawn | wf-t | 45.5 |       54 | r-new     | long? |
| front lawn | wf-l | 46.5 |       55 | g         | long? |
| front lawn | wf-r | 46.5 |       55 | f         |       |
|------------+------+------+----------+-----------+-------|
| din arch   |      |   94 |       99 | a         | x     |
| din arch   |      |   94 |       99 | b         | x     |
| din arch   |      |   54 |       63 | f         | x     |
| din arch   |      |   94 |       99 | c         | x     |
| din arch   |      |   94 |       99 | d         | x     |
| din arch   |      |   54 |       63 | g         | x     |
| entry arch |      | 94.5 |      100 | h         | x     |
| entry arch |      | 94.5 |      100 | j         | x     |
| entry arch |      |   67 |       75 | 96        | x     |
| entry arch |      |   67 |       75 | 96        |       |
| entry arch |      | 94.5 |      100 | k         | e     |
| entry arch |      | 94.5 |      100 | l         | f     |
|------------+------+------+----------+-----------+-------|

44, 41, 40, 62, 62, 54, 55, 55, 40
63, 63, 100, 100, 84, 84, 84, 84,
54, 40, 75, 75, 86, 86, 88, 88, 57

** Final run

- [X] a (90)  
- [X] b (90)
- [X] c (90)
- [X] d (95)
- [X] e (101)
- [X] f (101)
- [ ] g (45/55)
- [X] h (102)
- [X] i (102)
- [ ] j (102)
- [ ] k (101)
- [ ] l (101) 


** Re-reworked groups

This was the original grouping I created, but am not sure how it fits in with the new
order or what I was tracking when I did the big run last year (kitchen, office, 3/4 arch
sides). Created a headline above to reflect what I know I have and what I know remains to do.

- [X] a :: 75 = 120x
- [X] b :: 63 + 41 = 103x
- [X] c :: 100 = 101
- [X] d :: 63 + 40 = 101x
- [ ] e :: 75 = 101
- [X] f :: 55 + 44 = 101 
- [X] g :: 55 + 41u = 101 
- [X] h :: 54 + 40u = 101
- [ ] i :: 62 = 101
- [X] j :: 62 = 101
- [ ] k :: 100 = 101
- [ ] l :: 57 + 40 = 98
- [ ] m :: 84 = 97
- [ ] n :: 84 = 97
- [X] o :: 86 = 97x
- [X] p :: 86 = 97x
- [ ] q :: 54 + 40 = 95
- [X] r :: 88 = 89x
- [-] s :: 88 = 89x
- [ ] t :: 84 = 88x
- [ ] u :: 84 = 85x
- [ ] :: 120x (knot and crack)

- [ ] a :: 63 = 120x + 41?
- [ ] b :: 63 + 40 = 103x
- [ ] d ::  = 101x
- [ ] g :: 55 + 41 = 101 
- [ ] h :: 54 = 101
- [ ] :: 75 = 120x (knot and crack)


** Windows (2.25")

|  raw | buffered | group |
|------+----------+-------|
|   25 |       27 | l     |
|   25 |       27 | m     |
|   77 |       80 | l     |
|   77 |       80 | m     |
|   25 |       27 | n     |
|   25 |       27 | o     |
|   77 |       80 | n     |
|   77 |       80 | o     |
| 29.5 |       32 | p     |
| 29.5 |       32 | q     |
|   77 |       80 | p     |
|   77 |       80 | q     |


** Reworked groups

- [X] a :: 99 = 120
- [X] b :: 99 = 120
- [X] c :: 99 = 120
- [X] d :: 99 = 120 
- [X] h :: 100 = 120
- [X] j :: 100 = 120
- [ ] e :: 62 + 57 = 119 = 120
- [ ] f :: 63 + 55 = 118 = 120
- [ ] g :: 63 + 55 = 118 = 120 
- [ ] i :: 120 (knot and crack)
- [ ] k :: 100 = 120
- [ ] l :: 100 = 120
- [ ] m :: 7
- [ ] n :: 7
- [ ] o :: 7
- [ ] p :: 7
- [ ] q :: 54 + 40 = 94 = 96
- [ ] r :: 54 + 40 = 94 = 96
- [ ] s :: 44 + 41 = 85 = 96

Arches will require: 15 x 8': $276


* Doors

- Height (floor to top corner): 85in
- Width (corner to corner): 39in
- Doors: entry, dining/office x 2, dining/kitchen, office closet, entry
  closet (55in wide)

~1275in or ~108 ft

* Grand Total

| type    | length | cost/ft |   sub |
|---------+--------+---------+-------|
| base    |     90 |    1.55 | 139.5 |
| door    |    108 |    1.40 | 151.2 |
| window  |     70 |    1.40 |   98. |
|---------+--------+---------+-------|
| *total* |        |         | 388.7 |

Minus office
| type    | length | cost/ft |    sub |
|---------+--------+---------+--------|
| base    |     65 |    1.55 | 100.75 |
| door    |     73 |    1.40 |  102.2 |
| window  |     60 |    1.40 |    84. |
|---------+--------+---------+--------|
| *total* |        |         | 286.95 |
#+TBLFM: $2=108-(((170+40)*2)/12)::$4=vsum(@2..@-1)

* Doorway pieces required:

- Entry way sides: 95 x 5.25 (2)
- Entry way top: 67 x 5.25
- Dining room top: 55 x 6.5

Office is covered with pieces in garage; just get one planed to 3/4
- Office sides: 4.5, 4 x 82 (3/4") 
- Office top: 5 x 30 (1")
